; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v7 ?v3)
             (pred_12 ?v1 ?v9)
             (pred_6 ?v7 ?v9)
             (pred_1 ?v8 ?v7 )
	     (pred_9 ?v7)
             (pred_8 ?v6)
             (pred_3 ?v1)
             (pred_10 ?v9)
             (pred_7 ?v7)
             (pred_11 ?v1)
             (pred_4 ?v7)
             (pred_2 ))



(:action op_5
:parameters (?v11 ?v5 ?v2 ?v12)
:precondition (and (pred_8 ?v11) (pred_8 ?v5) (pred_3 ?v2) (pred_10 ?v12)
          (pred_5 ?v11 ?v5) (pred_12 ?v2 ?v12)
                   (pred_6 ?v5 ?v12) (pred_9 ?v11) 
                   (pred_7 ?v5) (pred_11 ?v2))
:effect (and  (pred_4 ?v5) (not (pred_7 ?v5))))


(:action op_4
:parameters (?v11 ?v13)
:precondition (and (pred_8 ?v11) (pred_8 ?v13)
               (pred_9 ?v11) (pred_5 ?v11 ?v13) (pred_4 ?v13))
:effect (and (pred_9 ?v13) (not (pred_9 ?v11))))

(:action op_1
:parameters (?v11 ?v2)
:precondition (and (pred_8 ?v11) (pred_3 ?v2) 
                  (pred_9 ?v11) (pred_1 ?v2 ?v11) (pred_2 ))
:effect (and (pred_11 ?v2)
   (not (pred_1 ?v2 ?v11)) (not (pred_2 ))))


(:action op_2
:parameters (?v11 ?v10 ?v4)
:precondition (and (pred_8 ?v11) (pred_3 ?v10) (pred_3 ?v4)
                  (pred_9 ?v11) (pred_11 ?v4) (pred_1 ?v10 ?v11))
:effect (and (pred_11 ?v10) (pred_1 ?v4 ?v11)
        (not (pred_11 ?v4)) (not (pred_1 ?v10 ?v11))))

(:action op_3
:parameters (?v11 ?v2)
:precondition (and (pred_8 ?v11) (pred_3 ?v2) 
                  (pred_9 ?v11) (pred_11 ?v2))
:effect (and (pred_2 ) (pred_1 ?v2 ?v11) (not (pred_11 ?v2)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_06 obj_08 obj_01 obj_02 obj_05 obj_03 obj_13 obj_04
    obj_09 obj_11
    obj_07 obj_10
    )

    (:init
       (pred_2)

       (pred_8 obj_12)
       (pred_8 obj_06)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_8 obj_02)
       (pred_8 obj_05)
       (pred_8 obj_03)
       (pred_8 obj_13)
       (pred_8 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_11)
       (pred_3 obj_07)
       (pred_3 obj_10)

       (pred_5 obj_12 obj_01)
       (pred_5 obj_12 obj_06)
       (pred_5 obj_06 obj_02)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_06 obj_12)
       (pred_5 obj_08 obj_05)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_01 obj_12)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_02 obj_06)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_05 obj_04)
       (pred_5 obj_05 obj_08)
       (pred_5 obj_05 obj_02)
       (pred_5 obj_03 obj_13)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_13 obj_02)
       (pred_5 obj_13 obj_03)
       (pred_5 obj_04 obj_05)
       (pred_5 obj_04 obj_13)
       (pred_7 obj_05)
       (pred_7 obj_04)
       (pred_6  obj_05 obj_09)
       (pred_6  obj_04 obj_11)
       (pred_4 obj_12)
       (pred_4 obj_06)
       (pred_4 obj_08)
       (pred_4 obj_01)
       (pred_4 obj_02)
       (pred_4 obj_03)
       (pred_4 obj_13)

       (pred_12  obj_07 obj_09)
       (pred_12  obj_10 obj_11)
       (pred_1 obj_07 obj_13)
       (pred_1 obj_10 obj_08)
       (pred_9 obj_06)
    )

    (:goal (and
       (pred_1 obj_10 obj_01)
    ))
(:constraints
  (always (not (pred_9 obj_12)))
)
)

; plan
1. (op_4 obj_06 obj_08)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_08)
   goals met: 0 of 1
2. (op_1 obj_08 obj_10)
   deleted: (pred_1 obj_10 obj_08) (pred_2)
   added: (pred_11 obj_10)
   goals met: 0 of 1
3. (op_4 obj_08 obj_06)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_06)
   goals met: 0 of 1
4. (op_4 obj_06 obj_02)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_02)
   goals met: 0 of 1
5. (op_4 obj_02 obj_01)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_01)
   goals met: 0 of 1
6. (op_3 obj_01 obj_10)
   deleted: (pred_11 obj_10)
   added: (pred_2) (pred_1 obj_10 obj_01)
   goals met: 1 of 1
